import os
Task = 0
List1 = ['1. Сумма всех цифр вещественного числа','2. Набор произведений чисел от 1 до N','3. Cписок из n чисел последовательности (1+1/n)^n','4. Произведение двух позиций из списка.','5. task 5','6. Выход']
os.system('cls')

def enter_key_to_continue():
    input('=================================================\nДля продолжения нажмите клавишу [ENTER]')
    main()

def error(x):
    os.system('cls')
    print(f'\n\n\nВНИМАНИЕ!!!\n    Вы ввели не существующую команду {x}... \n    Выберите команду из списка.')
    enter_key_to_continue()

# ========================= ДОМАШНЕЕ ЗАДАНИЕ ===========================

def Task01():
    print('Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.'
          '\nПример:'
          '\n- 6782 -> 23'
          '\n- 0,56 -> 11')
    num = float(input('Введите целое или вещественное число ->  '))
    n = num
    x = 1
    while x != 0:
        n = n*10
        x = n%1
    n = int(n)
    result = 0
    while n != 0:
        result = result + n%10
        n = n//10
    print(f'=================================================\nСумма всех цифр числа {num} = {result}\n=================================================\n')

def Task02():
    print('Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.'
          '\nПример:'
          '\n- пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)')
    num = int(input('Введите значение целого числа "N" ->  '))
    List1 = []
    for i in range(num):
        temp = 1
        for j in range(i+1):
            temp = temp * (j+1)
        List1.insert(i, temp)
    print(f'=================================================\n{List1}\n=================================================')

def Task03():
    print('Задайте список из n чисел последовательности (1+1/n)^n и выведите на экран их сумму.'
          '\nПример:'
          '\n- Для n = 6: [2.0, 2.25, 2.37037037037037, 2.44140625, 2.4883199999999994, 2.5216263717421135]')
    num = int(input('Введите значение целого числа "N" ->  '))
    List2 = []
    for i in range(num):
        j = i + 1
        temp = (1 + 1 / j) ** j
        List2.insert(i, temp)
    print(f'=================================================\n{List2}\n=================================================')
    
def Task04():
    print('Задайте список из N элементов, заполненных числами из промежутка [-N, N].'
          '\nНайдите произведение элементов на указанных позициях.'
          '\nПозиции хранятся в файле file.txt в одной строке одно число.'
          '\n(для продвинутых - с файлом, вариант минимум - ввести позиции в консоли)'
          '\n -2 -1 0 1 2 Позиции: 0,1 -> 2')
    num = int(input('Введите значение целого числа "N" ->  '))
    List2 = []
    j = 0
    for i in range(-num, num+1, 1):
        List2.insert(j, i)
        j = j + 1
    Positions = []
    with open("Positions.txt", "r") as file:
        k = 0
        for line in file:
            str1 = line
            Positions.insert(k,str1)
            k = k + 1
    Positions = [line.rstrip() for line in Positions]
    int_pos = []
    for lines in range(len(Positions)):
        int_pos.insert(lines, int(Positions[lines]))
    print(f'=================================================\n{List2}\n{int_pos[0]}, {int_pos[1]}   =>   {List2[int_pos[0]] * List2[int_pos[1]]}\n=================================================')

# def Task05():

# ======================================================================

def choice(x):
    os.system('cls')
    if x <= len(List1):
        print(f'=================================================\n{List1[x-1]}\n=================================================')
    if x == 1:
        Task01()
        enter_key_to_continue()
    elif x == 2:
        Task02()
        enter_key_to_continue()
    elif x == 3:
        Task03()
        enter_key_to_continue()
    elif x == 4:
        Task04()
        enter_key_to_continue()
    elif x == 5:
        print('Task 5')
        enter_key_to_continue()
    elif x == 6:
        import sys
        sys.exit()
    else:
        error(Task)

def main():
    os.system('cls')
    print('================================================\n============ Г Л А В Н О Е  М Е Н Ю ============\n================================================\nВыберите действие...')
    print(*List1, sep='\n')
    print('================================================')
    try:
        Task = int(input('Введите номер операции ->  '))
    except:
        Task = 0
    choice(Task)

main()