import sys
import os
List1 = ['1. Сумма всех цифр вещественного числа','2. task 2','3. task 3','4. task 4','5. task 5','6. Выход']
os.system('cls')

def enter_key_to_continue():
    input('=================================================\nДля продолжения нажмите клавишу [ENTER]')
    main()

def error(x):
    print('\n' * 100)
    print(f'\n\n\nВНИМАНИЕ!!!\n    Вы ввели не существующую команду {x}... \n    Выберите команду из списка.')
    enter_key_to_continue()

# ========================= ДОМАШНЕЕ ЗАДАНИЕ ===========================

def Task01():
    print('Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.'
          '\nПример:'
          '\n- 6782 -> 23'
          '\n- 0,56 -> 11')
    num = float(input('Введите целое или вещественное число ->  '))
    n = num
    x = 1
    while x != 0:
        n = n*10
        x = n%1
    n = int(n)
    result = 0
    while n != 0:
        result = result + n%10
        n = n//10
    print(f'=================================================\nСумма всех цифр числа {num} = {result}\n=================================================\n')

def Task02():
    print('Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.'
          '\nПример:'
          '\n- пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)')
    num = int(input('Введите значение целого числа "N" ->  '))
    List1 = []
    for i in range(num):
        temp = 1
        for j in range(i+1):
            temp = temp * (j+1)
        List1.insert(i, temp)
    print(f'=================================================\n{List1}\n=================================================')

# def Task03():

# def Task04():

# def Task05():

# ======================================================================

def choice(x):
    os.system('cls')
    print(f'=================================================\n{List1[x-1]}\n=================================================')
    if x == 1:
        Task01()
    elif x == 2:
        Task02()
    elif x == 3:
        print('Task 3')
    elif x == 4:
        print('Task 4')
    elif x == 5:
        print('Task 5')
    elif x == 6:
        sys.exit()
    enter_key_to_continue()

def main():
    os.system('cls')
    Task = int(0)
    print('================================================\n============ Г Л А В Н О Е  М Е Н Ю ============\n================================================\nВыберите действие...')
    print(*List1, sep='\n')
    print('================================================')
    Task = int(input('Введите номер операции ->  '))
    if 0 < Task <= len(List1):
        choice(Task)
    else:
        error(Task)

main()